// 题目描述
// 某医院想统计一下某项疾病的获得与否与年龄是否有关，需要对以前的诊断记录进行整理，按照0-18、19-35、36-60、61以上（含61）四个年龄段统计的患病人数占总患病人数的比例。

// 输入格式
// 共2行，第一行为过往病人的数目n（0 < n <= 100)，第二行为每个病人患病时的年龄。
// 输出格式
// 按照0-18、19-35、36-60、61以上（含61）四个年龄段输出该段患病人数占总患病人数的比例，以百分比的形式输出，精确到小数点后两位。每个年龄段占一行，共四行。

// 样例输入
// 10
// 1 11 21 31 41 51 61 71 81 91
// 样例输出
// 20.00%
// 20.00%
// 20.00%
// 40.00%
#include <stdio.h>
#define N 100
int main()
{
    int n,year,i;
    int sum=0,sum1=0,sum2=0,sum3=0,sum4=0;
    double a[N];
    scanf("%d",&n);
    for (i=0;i<n;i++) {
        scanf("%d",&year);
        if(year<=18) {
            sum1 += 1;
        } else if(year<=35) {
            sum2 += 1;
        } else if(year<=60) {
            sum3 += 1;
        } else {
            sum4 += 1;
        }
    }
    sum = sum1+sum2+sum3+sum4;
    a[0] = 1.0*sum1/sum*100;
    a[1] = 1.0*sum2/sum*100;
    a[2] = 1.0*sum3/sum*100;
    a[3] = 1.0*sum4/sum*100;
    for(i=0;i<4;i++) {
        printf("%.2f%%\n",a[i]);
    }

    return 0;
}
