// 题目描述
// 求10000以内n的阶乘。
// 输入格式
// 只有一行输入，整数n（0<=n<=10000）。
// 输出格式
// 一行，即n!的值。
// 样例输入
// 100
// 样例输出
// 93326215443944152681699238856266700490715968264381621468592963895217599993229915608941463976156518286253697920827223758251185210916864000000000000000000000000

#include <stdio.h>
#define N 10000
int main()
{
    int n,a,sum;
    int k[N];
    int t[N];
    scanf("%d",&n);
    for(int i=1;i<=n;i++) {
        
    }
    for(int i=0;i<n;i++) {
        scanf("%d",&a);
        k[i] = a;
    }
    
    return 0;
}
